motify/app/models/user.rb

  def generate_unique_session_token
    loop do
      session_token = SecureRandom::urlsafe_base64
      return session_token unless @user.exists?(session_token: session_token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 AND "users"."id" != $2 LIMIT $3  [["session_token", "[FILTERED]"], ["id", 1], ["LIMIT", 1]]