app/controllers/api/search_controller.rb

    def index
      @results = {
        artists: Artist.search(params[:q]),
        songs: Song.includes(:album).search(params[:q]),     # Eager load albums
        albums: Album.search(params[:q]),
        playlists: Playlist.search(params[:q])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60, $61, $62, $63, $64, $65, $66, $67, $68, $69, $70, $71, $72, $73, $74, $75, $76, $77, $78, $79, $80, $81, $82, $83, $84, $85)
SELECT "artists".* FROM "artists" WHERE (artist_name ILIKE '%ken%')
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 1]]
SELECT "playlists".* FROM "playlists" WHERE (title ILIKE '%ken%')