app/views/api/search/index.json.jbuilder

    json.extract! result, :id, :artist_name, :verified, :about_blurb, :about_img, :global_ranking, :monthly_listeners
    json.songs result.songs.map { |song|
---
SELECT "songs".* FROM "songs" WHERE (title ILIKE '%ken%')