app/controllers/playlists_controller.rb

  def create
    @playlist = Playlist.new(playlist_params)

    if @playlist.save
---
INSERT INTO "playlists" ("user_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["title", "Your Playlist Title"], ["created_at", "2023-11-23 21:28:58.720392"], ["updated_at", "2023-11-23 21:28:58.720392"]]

  def update
    @playlist = Playlist.find(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]