motify/app/views/albums/index.json.jbuilder

  json.artist do
    artist = Artist.find(album.artist_id)
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]